Change to use Mermaid
